a = int(input("Укажите день рождения Маши"))
b = int(input("Укажите месяц рождения Маши"))
c = int(input("Укажите весокосный ли год, 1 если - да, 0 - если нет"))
if (c==0):
    d = 365
else:
    d = 366
if (b == 1):
    e = 0
elif (b ==2 ):
    e = 31
elif (b ==3 ):
    e = 59
elif (b ==4 ):
    e = 90  
elif (b ==5 ):
    e = 120   
elif (b ==6 ):
    e = 151
elif (b ==7 ):
    e = 181
elif (b ==8 ):
    e = 212    
elif (b ==9 ):
    e = 242
elif (b ==10 ):
    e = 273
elif (b ==11 ):
    e = 303
elif (b ==12 ):
    e = 334
if(b == 1 or (b == 2 and a <= 14)):
    if(a <=14):
        if (b == 1):
            e = 0
        if (b == 2):
            e = 31
        f=45-(a+e)
else:
    f = d-(e+a)+31+14
            
f = d-(e+a)+131+14
print("Маше нужно ждать", f, "дней, до следующео любимого праздника")
